#Задано три різних цілих числа. Знайти суму двох найбільших чисел.

a = int(input('Введіть перше число: ')) #введення першого числа
b = int(input('Введіть друге число: ')) #введення другого числа
c = int(input('Введіть третє число: ')) #введення третього числа                          

if a >=b:               #якщо а більше або дорівнює b, то:
    max1 = a            #а - "перше більше число"
    min = b             #b - "менше число"
else:                   #інакше:
    max1 = b            #b - "перше більше число"
    min = a             #a - "менше число"
                        
if min >= c:            #якщо "менше число" більше за с 
    max2 = min          #"менше число" - "друге більше число"
else:                   #інакше
    max2 = c            #с - "друге більше число"

sum = max1 + max2                                      #обрахунок суми двох найбільших чисел
print("Сума двох найбільших чисел: " + str(sum))       #виведення суми - результату задачі

