#include <iostream>
#include <iomanip>
#include <cmath>    //включення математичної бібліотеки для знаходження модулю від числа

int main()
{
    float X, eps; int m;                            //ініціалізація ввідних даних
    std::cout << "Enter X: "; std::cin >> X;        //введення змінної X
    std::cout << "Enter m: "; std::cin >> m;        //введення показника степеню
    std::cout << "Enter eps: "; std::cin >> eps;    //введення точності ε
    float element = 1, S = 1, Sp;                   //ініціалізація елемента і суми, оголошення попередньої суми
    int i = 1;                                      //ініціалізація лічильника
    do {
        Sp = S;                             //фіксування попередньої суми
        element *= m * X / i;               //знаходження елемента           
        S += element;                       //обрахування суми
        std::cout << "S = " << std::setw(10) << std::fixed << std::setprecision(7) << S << "\n";   //проміжкове виведення суми
        i++;                                //збільшення лічильника
        m--;                                //зменшення показника степеню на 1
    } while (fabsf(S - Sp) > eps); //цикл виконується, поки модуль різниці поточної суми і попередньої більший або рівний за задану точність
    m = m + i - 1;                      //повернення початкового значення показника степеню
    if (m % 2 == 1)                 //якщо показник степеню непарний
        if (1 + X >= 0)                 //якщо основа степеня додатня
            S = fabsf(S);                   //сума додатня
        else                            //інкаше
            S = -1 * fabsf(S);              //сума від'ємна
    else                            //інашке
        S = fabsf(S);                   //сума додатня
    std::cout << "Result: S = " << S << "\n";   //виведення результату
    system("pause");
}