#include <iostream>
#include <iomanip>  //форматування виводу даних
#include <cmath>    //включення математичної бібліотеки для знаходження модулю від числа (fabsf() повертає значення типу float)

int main()
{
    float X, eps; int m;                            //ініціалізація ввідних даних
    std::cout << "Enter X: "; std::cin >> X;        //введення змінної X
    std::cout << "Enter m: "; std::cin >> m;        //введення показника степеню
    std::cout << "Enter eps: "; std::cin >> eps;    //введення точності ε    
    float element = 1, S = 1, element_p, diff;      //ініціалізація елемента і суми, оголошення попереднього елемента та різниці
    int i = 1;                                      //ініціалізація лічильника
    int m_2 = m;                                    //дублювання показника степеню для використання у циклі    
    do {
        element_p = element;                //фіксування попереднього елемента
        element *= m_2 * X / i;             //знаходження елемента           
        S += element;                       //обрахування суми        
        i++;                                //збільшення лічильника
        m_2--;                              //зменшення показника степеню на 1
        diff = fabsf(element - element_p);  //модуль різниці останніх двох елементів суми
        std::cout << "diff = " << std::setw(15) << std::fixed << std::setprecision(7) << diff << "\n"; //проміжкове виведення різниці
    } while (diff > eps); //цикл виконується, поки модуль різниці більший за задану точність    
    if (m % 2 == 1)                 //якщо показник степеню непарний
        if (1 + X >= 0)                 //якщо основа степеня додатня
            S = fabsf(S);                   //сума додатня
        else                            //інкаше
            S = -1 * fabsf(S);              //сума від'ємна
    else                            //інашке
        S = fabsf(S);                   //сума додатня    
    std::cout << "\n" << "Result: " << S << "\n";   //виведення результату
    system("pause");
}