#include <iostream>
#include <iomanip>  //форматування виводу даних
#include <cmath>    //включення математичної бібліотеки для знаходження модулю від числа
using namespace std;

int main()
{
    float X, eps; int m;                            //ініціалізація ввідних даних
    cout << "Enter X: "; cin >> X;                  //введення змінної X
    cout << "Enter m: "; cin >> m;                  //введення показника степеню
    cout << "Enter eps: "; cin >> eps;              //введення точності ε    
    float element = 1, S = 1, element_p, diff;      //ініціалізація елемента і суми, оголошення попереднього елемента та різниці
    int i = 1;                                      //ініціалізація лічильника
    int m_2 = m;                                    //дублювання показника степеню для використання у циклі    
    do {
        element_p = element;                //фіксування попереднього елемента
        element *= m_2 * X / i;             //знаходження елемента           
        S += element;                       //обрахування суми        
        i++;                                //збільшення лічильника
        m_2--;                              //зменшення показника степеню на 1
        diff = fabs(element - element_p);   //модуль різниці останніх двох елементів суми
        cout << "diff = " << setw(15) << fixed << setprecision(7) << diff << "\n"; //проміжкове виведення різниці
    } while (diff > eps); //цикл виконується, поки модуль різниці більший за задану точність    
    if (m % 2 == 1)                 //якщо показник степеню непарний
        if (1 + X >= 0)                 //якщо основа степеня додатня
            S = fabs(S);                   //сума додатня
        else                            //інкаше
            S = -1 * fabs(S);              //сума від'ємна
    else                            //інашке
        S = fabs(S);                   //сума додатня    
    cout << "\n" << "Result: " << S << "\n";   //виведення результату
    system("pause");
}