//Задано три різних цілих числа. Знайти суму двох найбільших чисел.

#include <iostream>
using namespace std;

int main()
{
    int a, b, c;            //ввідні дані
    int max1, max2, min;    //проміжні дані
    int sum;                //результат 

    cout << "Enter the first number: "; cin >> a;   //введення першого числа
    cout << "Enter the second number: "; cin >> b;  //введення другого числа
    cout << "Enter the third number: "; cin >> c;   //введення третього числа

    if (a >= b) {                       //якщо а більше або дорівнює b, то:
        max1 = a;                       //а - "перше більше число"
        min = b;                        //b - "менше число"
    }
    else {                              //інакше:
        max1 = b;                       //b - "перше більше число"
        min = a;                        //a - "менше число"
    };
    
    if (min >= c) {                     //якщо "менше число" більше за с 
        max2 = min;                     //"менше число" - "друге більше число"
    }
    else max2 = c;                      //інакше с - "друге більше число"

    sum = max1 + max2;                  //обрахунок суми двох найбільших чисел
    cout << "Result: " << sum;          //виведення суми - результату задачі
}




/*
Альтернативний розв'язок:                                    

if (a >= b && a >= c) {             //якщо а більше або дорівнює b і c, то:
    max1 = a;                       //а - найбільше число
    if (b > c) max2 = b;            //якщо b більше за c, то b - друге більше число
    else max2 = c;                  //інакше друге більше число - с
}
else if (b >= a && b >= c) {        //інашке якщо b більше або дорівнює a і c, то: 
    max1 = b;                       //b - найбільше число
    if (a > c) max2 = a;            //якщо a більше за c, то a - друге більше число
    else max2 = c;                  //інакше друге більше число - с
}
else {                              //інакше:
    max1 = c;                       //c - найбільше число
    if (a > b) max2 = a;            //якщо a більше за b, то a - друге більше число
    else max2 = b;                  //інакше друге більше число - b
}
*/