n = 0 #кількість виведених чисел
for i in range (1000, 10000): #перебір чотиризначних чисел
    check = True
    k = 1000
    while k > 1: #цикл визначає від першої до третьої цифри числа
        d1 = i % (k*10) // k #визначення однієї цифри
        l = k // 10
        while l > 0: #цикл визначає від другої до четвертої цифри числа
            d2 = i % (l*10) //l #визначення другої цифри
            if d1 == d2: #порівняння цифр
                check = False
            l = l // 10
        k = k // 10
    if check == True: #виведення числа, якщо однакових цифр не знайдено
        print(i)
        n = n + 1
print("Кількість чисел: "+str(n))