n = 0;    #кількість виведених чисел
for i in range(10, 100): #перерахунок тисяч і сотень
    d1 = i // 10            #кількість тисяч
    d2 = i % 10             #кількість сотень    
    for k in range(100):     #перерахунок десяток і одиниць
        d3 = k // 10            #кількість десятків
        d4 = k % 10             #кількість одиниць
        check = d1 != d2 and d1 != d3 and d1 != d4 and d2 != d3 and d2 != d4 and d3 != d4
        if check:       #виведення чотиризначного числа, в записі якого немає однакових цифр
            print(i*100+k)
            n=n+1
print("Кількість чисел: " + str(n))