#include <iostream>
using namespace std;

int main()
{
	bool check; //булева змінна для перевірки нерівності цифр
	int d1, d2; //цифри, що будуть порівнюватися
	int k, l;	//розряд цифр, що будуть порівнюватися
	int n = 0;	//кількість виведених чисел
	for (int i = 1000; i < 10000; i++) //перебір чотиризначних чисел
	{
		k = 1000;
		check = true;
		while(k > 1) //цикл визначає від першої до третьої цифри числа
		{
			d1 = i % (k * 10) / k; //визначення однієї цифри
			l = k / 10; 
			while (l > 0) //цикл визначає від другої до четвертої цифри числа
			{
				d2 = i % (l * 10) / l; //визначення другої цифри
				if (d1 == d2) //порівняння цифр
					check = false;
				l = l / 10;
			}
			k = k / 10;
		}
		if (check == true) //виведення числа, якщо однакових цифр не знайдено
		{
			cout << i << endl;
			n++;
		}
	}
	cout << "n = " << n << endl;
	system("pause");
}
