#include <iostream>
#include <cmath>

using namespace std;

int main()
{
	int d1, d2, d3, d4;		//цифри чотиризначного числа
	bool check;				//булева змінна для перевірки нерівності цифр
	int n = 0;				//кількість виведених чисел
	for (int i = 10; i < 100; i++)	//тисячі та сотні
	{
		d1 = i / 10;		//кількість тисяч
		d2 = i % 10;		//кількість сотень
		for (int k = 0; k < 100; k++) //десятки та одиниці
		{
			d3 = k / 10;		//кількість десяток
			d4 = k % 10;		//кількість одиниць
			check = d1 != d2 && d1 != d3 && d1 != d4;
			check = check && d2 != d3 && d2 != d4 && d3 != d4;
			if (check) { //виведення чотиризначного числа, в записі якого немає однакових цифр
				cout << i * 100 + k << endl;
				n++;
			}
		}
	}
	cout << "n = " << n << endl;
	system("pause");
}